------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\Dropbox\@Projects_Active\MGMT_source\data\ManSci\replication_package\analysis_test\programs\BBCVW_replic
> ation_flows_24_Nov_2020.log
  log type:  text
 opened on:  24 Nov 2020, 19:10:13

. 
. /* install any packages locally */
. sysdir set PERSONAL "$adobase/ado/personal"

. sysdir set PLUS     "$adobase/ado/plus"

. sysdir set SITE     "$adobase/ado/site"

. 
. /* See https://www.stata.com/manuals13/pcreturn.pdf#pcreturn */
. local variant = cond(c(MP),"MP",cond(c(SE),"SE",c(flavor)) )  

. 
. di "=== SYSTEM DIAGNOSTICS ==="
=== SYSTEM DIAGNOSTICS ===

. di "Stata version: `c(stata_version)'"
Stata version: 15.1

. di "Updated as of: `c(born_date)'"
Updated as of: 03 Feb 2020

. di "Variant:       `variant'"
Variant:       MP

. di "Processors:    `c(processors)'"
Processors:    4

. di "OS:            `c(os)' `c(osdtl)'"
OS:            Windows 64-bit

. di "Machine type:  `c(machine_type)'"
Machine type:  PC (64-bit x86-64)

. di "=========================="
==========================

. 
end of do-file

. 
. pause on

. set more off

. set linesize 120                                                                                                      
>   

. 
. 
. use "${inpath}/WMS_RAIS_flow_plantdata.dta", clear

. 
. egen reg_num = group(region)

. 
. global ctrl_jole i.reg_num i.year i.own_cat lfirmage female_share i.compet_cat mis_competition c.AKM_coverage##c.AKM_c
> overage##c.AKM_coverage

. 
. global basis i.reg_num i.year i.own_cat lfirmage female_share c.AKM_coverage##c.AKM_coverage##c.AKM_coverage

. 
. la var zmanagement "z-management"

. la var lemp        "ln(employment)"

. la var age_fires   "Mean age (fired)" 

. la var coll_fires  "\% college (fired)"

. la var degree_t    "\% college"

. 
. /*TABLE 6*/
. foreach num of numlist 10 25 50 75 90{
  2.     qui eststo tab6_`num'_a: areg inflow_p`num' zmanagement degree_t ${ctrl_jole} if inflow_tot >= 3, cluster(cnpj)
>  ab(sic2)
  3.         gen samp = e(sample)
  4.     qui eststo tab6_`num'_b: areg inflow_p`num' zmanagement degree_t lemp ${ctrl_jole} if samp==1, cluster(cnpj) ab
> (sic2)
  5.     drop samp
  6. }

. 
. esttab tab6_10_a tab6_25_a tab6_50_a tab6_75_a tab6_90_a using "${tabpath}/BBCVW_tab6a_rep.tex", ///
>     f label replace     keep(zmanagement degree_t)      order (zmanagement degree_t) ///
>     compress collabels(none) nodepvars nogap nonum noobs nomtitle ///
>     cells(b(star fmt(3)) se(par fmt(3))) /// 
>     mgroups("A. Not Including Size Control", pattern(1 0 0 0 0) prefix(\multicolumn{@span}{c}{) suffix(}) span ) 
(note: file ../output/tables/BBCVW_tab6a_rep.tex not found)
(output written to ../output/tables/BBCVW_tab6a_rep.tex)

. 
. esttab tab6_10_b tab6_25_b tab6_50_b tab6_75_b tab6_90_b using "${tabpath}/BBCVW_tab6b_rep.tex", ///
>     f label replace     keep(zmanagement degree_t lemp)         order (zmanagement degree_t lemp) ///
>     compress collabels(none) nodepvars nogap nomtitle nonum  ///
>     cells(b(star fmt(3)) se(par fmt(3))) /// 
>     scalar ("N_clust Firms")  ///
>     mgroups("B. Including Size Control", pattern(1 0 0 0 0) prefix(\multicolumn{@span}{c}{) suffix(}) span ) 
(note: file ../output/tables/BBCVW_tab6b_rep.tex not found)
(output written to ../output/tables/BBCVW_tab6b_rep.tex)

.     
. /*Print to Stata log*/
. esttab tab6_10_a tab6_25_a tab6_50_a tab6_75_a tab6_90_a ,  label replace       keep(zmanagement degree_t)      order 
> (zmanagement degree_t) compress collabels(none) nodepvars nogap nomtitle cells(b(star fmt(3)) se(par fmt(3))) scalar (
> "N_clust Firms")

---------------------------------------------------------------------------------
                       (1)          (2)          (3)          (4)          (5)   
---------------------------------------------------------------------------------
z-management         0.001        0.006*       0.012**      0.014**      0.012***
                   (0.001)      (0.003)      (0.004)      (0.004)      (0.004)   
\% college           0.000*       0.001**      0.001*       0.001*       0.001*  
                   (0.000)      (0.000)      (0.000)      (0.000)      (0.000)   
---------------------------------------------------------------------------------
Observations          3857         3857         3857         3857         3857   
Firms                  706          706          706          706          706   
---------------------------------------------------------------------------------

. 
. esttab tab6_10_b tab6_25_b tab6_50_b tab6_75_b tab6_90_b ,  label replace       keep(zmanagement degree_t lemp)       
>   order (zmanagement degree_t lemp) compress collabels(none) nodepvars nogap nomtitle cells(b(star fmt(3)) se(par fmt(
> 3))) scalar ("N_clust Firms")

---------------------------------------------------------------------------------
                       (1)          (2)          (3)          (4)          (5)   
---------------------------------------------------------------------------------
z-management         0.002        0.005        0.011*       0.011*       0.009*  
                   (0.002)      (0.003)      (0.004)      (0.005)      (0.004)   
\% college           0.000*       0.001**      0.001*       0.001*       0.001   
                   (0.000)      (0.000)      (0.000)      (0.000)      (0.000)   
ln(employment)      -0.002        0.001        0.004        0.007        0.008*  
                   (0.002)      (0.003)      (0.004)      (0.005)      (0.004)   
---------------------------------------------------------------------------------
Observations          3857         3857         3857         3857         3857   
Firms                  706          706          706          706          706   
---------------------------------------------------------------------------------

. 
. 
. 
. 
. /*TABLE 7*/
. gen delta_peff_outflow = pe_fires - pe_stayers
(30 missing values generated)

. 
. cap eststo clear

. 
. replace coll_fires = coll_fires / 100
(3,226 real changes made)

. qui eststo tab7_4: areg delta_peff_outflow zmanagement age_fires coll_fires degree_t ${ctrl_jole} if fire_tot>=3, clus
> ter(cnpj) absorb(sic2)

. gen samp = e(sample)

. qui eststo tab7_1: areg delta_peff_outflow zmanagement c.AKM_coverage##c.AKM_coverage##c.AKM_coverage if samp==1, clus
> ter(cnpj) absorb(sic2)

. qui eststo tab7_2: areg delta_peff_outflow zmanagement ${ctrl_jole} degree_t if samp==1, cluster(cnpj) absorb(sic2)

. qui eststo tab7_3: areg delta_peff_outflow zmanagement age_fires ${ctrl_jole} degree_t if samp==1, cluster(cnpj) absor
> b(sic2)

. 
. 
. esttab tab7_1 tab7_2 tab7_3 tab7_4 using "${tabpath}/BBCVW_tab7_rep.tex", booktabs label replace ///
>         keep(zmanagement age_fires coll_fires)  order (zmanagement age_fires coll_fires) /// 
>     compress collabels(none) nodepvars nogap nomtitle ///
>     cells(b(star fmt(3)) se(par fmt(3))) scalar ("N_clust Firms") ///
>      mgroups("Avg ability of fired - Avg ability of incumbents", pattern(1 0 0 0 0) prefix(\multicolumn{@span}{c}{) su
> ffix(}) span  erepeat(\cmidrule(lr){@span}) ) 
(note: file ../output/tables/BBCVW_tab7_rep.tex not found)
(output written to ../output/tables/BBCVW_tab7_rep.tex)

.    
. 
. esttab tab7_1 tab7_2 tab7_3 tab7_4, label replace       keep(zmanagement age_fires coll_fires)  order (zmanagement age
> _fires coll_fires) compress collabels(none) nodepvars nogap nomtitle cells(b(star fmt(3)) se(par fmt(3))) scalar ("N_c
> lust Firms")

--------------------------------------------------------------------
                       (1)          (2)          (3)          (4)   
--------------------------------------------------------------------
z-management        -0.062***    -0.041***    -0.039***    -0.036***
                   (0.010)      (0.010)      (0.010)      (0.009)   
Mean age (fired)                               0.007***     0.010***
                                             (0.002)      (0.002)   
\% college (fi~)                                           -0.983   
                                                          (0.542)   
--------------------------------------------------------------------
Observations          3856         3856         3856         3856   
Firms                  704          704          704          704   
--------------------------------------------------------------------

. 
. 
. /*count number of flows*/
. preserve

. collapse (sum) inflow_tot fire_tot

. sum inflow_tot fire_tot

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  inflow_tot |          1      519516           .     519516     519516
    fire_tot |          1      248033           .     248033     248033

. restore

. 
. preserve

. 
. cap log close
