------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\Dropbox\@Projects_Active\MGMT_source\data\ManSci\replication_package\analysis_test\programs\CSS_ability_
> dist_24_Nov_2020.log
  log type:  text
 opened on:  24 Nov 2020, 19:10:22

. 
. /* install any packages locally */
. sysdir set PERSONAL "$adobase/ado/personal"

. sysdir set PLUS     "$adobase/ado/plus"

. sysdir set SITE     "$adobase/ado/site"

. 
. /* See https://www.stata.com/manuals13/pcreturn.pdf#pcreturn */
. local variant = cond(c(MP),"MP",cond(c(SE),"SE",c(flavor)) )  

. 
. di "=== SYSTEM DIAGNOSTICS ==="
=== SYSTEM DIAGNOSTICS ===

. di "Stata version: `c(stata_version)'"
Stata version: 15.1

. di "Updated as of: `c(born_date)'"
Updated as of: 03 Feb 2020

. di "Variant:       `variant'"
Variant:       MP

. di "Processors:    `c(processors)'"
Processors:    4

. di "OS:            `c(os)' `c(osdtl)'"
OS:            Windows 64-bit

. di "Machine type:  `c(machine_type)'"
Machine type:  PC (64-bit x86-64)

. di "=========================="
==========================

. 
end of do-file

. 
. pause on

. set more off

. set linesize 120                                                                                                      
>  

. 
. /* %*************************************************************************** */
. use "${inpath}/WMS_RAIS_linked_microdata.dta", clear

. 
. *-----------------------------------------------------------------
. * APPENDIX: PE KERNEL DENSITY PLOTS
. *-----------------------------------------------------------------
. 
. sum akm_pe log_wage, detail

              Estimated person effect from AKM
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1.450347      -5.415983
 5%    -1.065842      -4.990226
10%    -.9073753      -4.575579       Obs             294,551
25%    -.6560236      -4.566435       Sum of Wgt.     294,551

50%    -.2911983                      Mean          -1.83e-11
                        Largest       Std. Dev.             1
75%     .3897638       6.959043
90%     1.395883       7.103202       Variance              1
95%     2.057073       7.571113       Skewness        1.55348
99%     3.400903       8.672927       Kurtosis       6.227545

                          log_wage
-------------------------------------------------------------
      Percentiles      Smallest
 1%     1.098368      -.0476925
 5%     1.365439       -.047099
10%     1.504076      -.0412681       Obs             390,557
25%     1.776304      -.0364768       Sum of Wgt.     390,557

50%     2.124129                      Mean           2.289506
                        Largest       Std. Dev.      .7524496
75%     2.646331        6.43173
90%     3.341704       6.433305       Variance       .5661804
95%     3.805653       6.450536       Skewness       1.117906
99%     4.632599       6.499043       Kurtosis       4.638049

. sum akm_pe log_wage if occ_labr == 1, detail

              Estimated person effect from AKM
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1.457625      -5.415983
 5%    -1.072677      -4.990226
10%    -.9144157      -4.575579       Obs             285,219
25%    -.6661555      -4.566435       Sum of Wgt.     285,219

50%    -.3157481                      Mean          -.0732202
                        Largest       Std. Dev.      .8909881
75%     .3067728       6.517308
90%     1.190212       6.517308       Variance       .7938598
95%     1.756567       6.938724       Skewness       1.338749
99%     2.815787       7.571113       Kurtosis       5.391866

                          log_wage
-------------------------------------------------------------
      Percentiles      Smallest
 1%     1.090846      -.0476925
 5%     1.360224       -.047099
10%     1.498287      -.0412681       Obs             380,527
25%     1.767245      -.0364768       Sum of Wgt.     380,527

50%     2.106195                      Mean             2.2437
                        Largest       Std. Dev.      .6909588
75%     2.596107       6.304146
90%     3.220017       6.322094       Variance       .4774241
95%     3.625836       6.357973       Skewness       .9404593
99%     4.269598       6.374509       Kurtosis       4.145777

. sum akm_pe log_wage if occ_mngr == 1, detail

              Estimated person effect from AKM
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.7567544       -2.75843
 5%    -.2662372       -1.89132
10%     .1957406      -1.715685       Obs               9,332
25%      1.20365      -1.641291       Sum of Wgt.       9,332

50%     2.318233                      Mean           2.237869
                        Largest       Std. Dev.      1.458995
75%      3.25574       6.826553
90%     4.070533       6.959043       Variance       2.128667
95%     4.590067       7.103202       Skewness      -.0203995
99%     5.569604       8.672927       Kurtosis       2.633931

                          log_wage
-------------------------------------------------------------
      Percentiles      Smallest
 1%     1.739293       .9388025
 5%     2.336183       1.020683
10%     2.750171       1.172265       Obs              10,030
25%     3.426323       1.196407       Sum of Wgt.      10,030

50%     4.161473                      Mean           4.027328
                        Largest       Std. Dev.      .9132027
75%     4.667731        6.43173
90%     5.091654       6.433305       Variance       .8339392
95%      5.36792       6.450536       Skewness      -.4311361
99%     5.902324       6.499043       Kurtosis       2.908856

. 
. sum occ_mngr if occ_labr==1 | occ_mngr==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    occ_mngr |    398,354    .0254497    .1574868          0          1

.         
. twoway  (kdensity akm_pe if occ_labr==1 , lcolor(navy) lwidth(thick) lpattern(dash)) ///
>         (kdensity akm_pe if occ_mngr==1  , lcolor(maroon) lwidth(thick) lpattern(solid)), ///
>         ytitle(Density) xtitle("Worker quality") graphregion(fcolor(white) lcolor(white) ifcolor(white) ilcolor(white)
> ) ///
>         legend(label(1 "Production workers") label(2 "Managers") col(1) ring(0) pos(2) symx(4) region(lcolor(white)))

.         
. * local figpath ./output/figures        
. graph save "${figpath}/PE_histogram.gph", replace
(note: file ../output/figures/PE_histogram.gph not found)
(file ../output/figures/PE_histogram.gph saved)

. graph export "${figpath}/PE_histogram.pdf", as(pdf) replace 
(file ../output/figures/PE_histogram.pdf written in PDF format)

. 
. twoway  (kdensity log_wage if occ_labr==1 , lcolor(navy) lwidth(thick) lpattern(dash)) ///
>         (kdensity log_wage if occ_mngr==1 , lcolor(maroon) lwidth(thick) lpattern(solid)), ///
>         ytitle(Density) xtitle("Log Wage") graphregion(fcolor(white) lcolor(white) ifcolor(white) ilcolor(white)) ///
>         legend(label(1 "Production workers") label(2 "Managers") col(1) ring(0) pos(2) symx(4) region(lcolor(white)))

. 
. graph save "${figpath}/logwage_histogram.gph", replace
(note: file ../output/figures/logwage_histogram.gph not found)
(file ../output/figures/logwage_histogram.gph saved)

. graph export "${figpath}/logwage_histogram.pdf", as(pdf) replace 
(file ../output/figures/logwage_histogram.pdf written in PDF format)

. 
. cap log close
